
*** Compile

+ Note, before compiling ModelE you might need to make some changes for it to work with =gfortran=, such as

#+BEGIN_SRC bash :exports both :results verbatim :dir ../modelE 
git diff
#+END_SRC

#+RESULTS:
#+begin_example
diff --git a/config/compiler.gfortran.mk b/config/compiler.gfortran.mk
index a991e1a05..41878da23 100644
--- a/config/compiler.gfortran.mk
+++ b/config/compiler.gfortran.mk
@@ -63,10 +63,10 @@ endif
 # flags needed for particular releases
 
 FFLAGS_RELEASE =
-ifneq (,$(filter 10 11 12,$(GFORTRAN_RELEASE)))
+ifeq ($(GFORTRAN_RELEASE),10)
 FFLAGS_RELEASE += -fallow-argument-mismatch
 endif
-ifneq (,$(filter 8 9 10 11 12,$(GFORTRAN_RELEASE)))
+ifneq (,$(filter 8 9 10,$(GFORTRAN_RELEASE)))
 FFLAGS_RELEASE += -fwrapv
 endif
 
#+end_example

#+BEGIN_SRC screen
docker run -it \
       --user $(id -u):$(id -g) \
       --env MODELERC="/home/user/.modelErc.docker" \
       --mount type=bind,src=${HOME},dst=/home/user \
       --mount type=bind,src=$(pwd)/../modelE,dst=/modelE \
       --mount type=bind,src=$(pwd)/../ModelE_Support,dst=/ModelE_Support \
       modele \
       bash

cd /modelE/decks/
make rundeck RUNSRC=E4M20 RUN=E4M20_docker_test01
../exec/get_input_data -w E4M20_test01 ../../ModelE_Support/prod_input_files/

make clean RUN=E4M20_docker_test01
make -j setup RUN=E4M20_docker_test01
#+END_SRC

